Repository: leogottadothebest/AutoToggle
Catalog: AutoToggle/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: 10 秒
en: 10 seconds

source: 30 秒
en: 30 seconds

source: 60 秒
en: 60 seconds

source: AutoToggle 启动完成
en: AutoToggle started

source: AutoToggle 将在菜单栏安静运行，不占用 Dock 空间。
en: AutoToggle runs quietly in the menu bar without taking up Dock space.

source: AutoToggle 通常无需额外权限，以下两项按需授权：
en: AutoToggle normally needs no extra permissions. Grant the following two only when needed:

source: AutoToggle 防止显示器休眠
en: AutoToggle prevents display sleep

source: AutoToggle 防止系统休眠
en: AutoToggle prevents system sleep

source: AutoToggle 需要以下权限来正常工作：
en: AutoToggle needs the following permission to work properly:

# appPicker.cancel
source: 取消
en: Cancel

# appPicker.chooseFinder
source: 在 Finder 中选取...
en: Choose in Finder...

# appPicker.count %lld
source: %lld 个应用
en: %lld apps

# appPicker.finderMessage
source: 选择要管理的应用程序
en: Select an application to manage

# appPicker.loading
source: 正在加载应用列表...
en: Loading applications...

# appPicker.search
source: 搜索应用名称...
en: Search applications...

# card.activeProfile
source: 配置方案
en: Active Profile

# card.activeRules
source: 活跃规则
en: Active Rules

# card.managedApps
source: 被管理应用
en: Managed Apps

# card.permissionStatus
source: 权限状态
en: Permission

# card.sleepPrevention
source: 防睡眠
en: Sleep

# editor.cancel
source: 取消
en: Cancel

# editor.deleteRule
source: 删除规则
en: Delete Rule

# editor.editRule
source: 编辑规则
en: Edit Rule

# editor.newRule
source: 新建规则
en: New Rule

# editor.quitStrategy
source: 退出策略
en: Quit Strategy

# editor.quitStrategyHint
source: 普通退出：仅 AppleScript 优雅退出。强制退出：三级降级（AppleScript → terminate → 强制终止）。「跟随全局」使用设置中的默认策略。
en: Normal: AppleScript quit only. Force: three-level fallback (AppleScript → terminate → force terminate).

# editor.save
source: 保存
en: Save

# editor.searchApp
source: 点击搜索并选择应用
en: Click to search and select

# editor.targetApp
source: 目标应用
en: Target App

# editor.triggerType
source: 触发类型
en: Trigger Type

# idle.scope.appHint
source: 目标应用未处于前台达指定时长后触发。
en: Fires when the target app has been out of the foreground for the specified duration.

# idle.scope.systemHint
source: 整个系统无键盘/鼠标输入达指定时长后触发（全局闲置，例如离开电脑时）。
en: Fires when the entire system has had no keyboard/mouse input for the specified duration (global idle, e.g. when you step away).

# log.addRule %@ %@
source: 添加规则: %@ - %@
en: Added rule: %@ – %@

# log.category.activity
source: 活动
en: activity

# log.category.system
source: 系统
en: system

# log.clearConfirm %@
source: 确定要清除所有「%@」日志吗？此操作不可撤销。
en: Clear all "%@" logs? This cannot be undone.

# log.deleteRule %@ %@
source: 删除规则: %@ - %@
en: Deleted rule: %@ – %@

# log.displayOff
source: 已关闭防显示器关闭
en: Display sleep prevention turned off

# log.displayOn
source: 已开启防显示器关闭
en: Display sleep prevention turned on

# log.entryCount %lld
source: %lld 条记录
en: %lld entries

# log.forceQuit %@
source: 强制退出: %@ (forceTerminate)
en: Force-quit %@ (forceTerminate)

# log.launchFailed %@ %@
source: 启动失败: %@ - %@
en: Launch failed: %@ – %@

# log.launchedApp %@
source: 启动应用: %@
en: Launched %@

# log.noActivity
source: 暂无活动日志
en: No activity logs

# log.noSystem
source: 暂无系统日志
en: No system logs

# log.normalQuitFailed %@
source: %@ 普通退出失败（应用不支持 AppleScript quit），已跳过
en: %@ failed to quit normally (the app doesn't support AppleScript quit) and was skipped

# log.quitApp %@
source: 退出应用: %@
en: Quit %@

# log.rejectActivate %@
source: 拒绝激活非法 Bundle ID（疑似注入）: %@
en: Rejected activation of invalid bundle ID (possible injection): %@

# log.rejectHide %@
source: 拒绝隐藏非法 Bundle ID（疑似注入）: %@
en: Rejected hide of invalid bundle ID (possible injection): %@

# log.rejectLaunch %@
source: 拒绝启动非法 Bundle ID（疑似注入）: %@
en: Rejected launch of invalid bundle ID (possible injection): %@

# log.rejectQuit %@
source: 拒绝退出非法 Bundle ID（疑似注入）: %@
en: Rejected quit of invalid bundle ID (possible injection): %@

# log.sleepOff
source: 已关闭防系统休眠
en: System sleep prevention turned off

# log.sleepOn
source: 已开启防系统休眠
en: System sleep prevention turned on

# overview.managedApps
source: 被管理的应用
en: Managed Apps

# overview.nextTrigger
source: 下次触发
en: Next Trigger

# overview.noActivity
source: 暂无活动记录
en: No activity records

# overview.noManagedAppsRunning
source: 暂无运行中的被管理应用
en: No managed apps running

# overview.recentActivity
source: 最近活动
en: Recent Activity

# profile.autoName %lld
source: 配置%lld
en: Profile %lld

# profile.default
source: 默认方案
en: Default

# profile.defaultName
source: 配置1
en: Profile 1

# profile.deleteConfirm %@
source: 确定要删除配置方案「%@」吗？其中的所有规则将被永久删除。此操作不可撤销。
en: Delete profile "%@"? All its rules will be permanently deleted. This cannot be undone.

# quitStrategy.followGlobal
source: 跟随全局
en: Follow Global

# quitStrategy.force
source: 强制退出
en: Force Quit

# quitStrategy.normal
source: 普通退出
en: Normal Quit

# row.idleFor %@
source: 闲置 %@
en: Idle %@

# row.quitApp %@
source: 退出 %@
en: Quit %@

# ruleCount %lld
source: %lld 条规则
en: %lld rules

# ruleType.idleHide
source: 闲置隐藏
en: Idle Hide

# ruleType.idleQuit
source: 闲置退出
en: Idle Quit

# ruleType.scheduledLaunch
source: 定时启动
en: Timed Launch

# ruleType.scheduledQuit
source: 定时退出
en: Timed Quit

# scope.idle
source: 闲置
en: Idle

# scope.systemIdle
source: 系统闲置
en: System idle

# search.noRulesMatch %@
source: 未找到匹配「%@」的规则
en: No rules match "%@"

# settings.quitStrategy
source: 退出策略
en: Quit Strategy

# settings.quitStrategyFooter
source: 普通退出仅使用 AppleScript 优雅退出。强制退出使用三级降级策略。每条规则可在编辑时覆盖此默认设置。
en: Normal quit uses AppleScript only. Force quit uses a three-level fallback. Individual rules can override this default.

# settings.quitStrategyHeader
source: 退出策略
en: Quit Strategy

# short.idleHide %@ %lld
source: %@ %lld 分钟后隐藏
en: %@ · hide after %lld min

# short.idleQuit %@ %lld
source: %@ %lld 分钟后退出
en: %@ · quit after %lld min

# short.scheduledLaunch %@ %@
source: %@ %@ 启动
en: Launch %@ at %@

# short.scheduledQuit %@ %@
source: %@ %@ 退出
en: Quit %@ at %@

# status.active
source: 活跃
en: Active

# status.authorized
source: 已授权
en: Authorized

# status.idle
source: 闲置
en: Idle

# status.notRunning
source: 未运行
en: Not Running

# status.off
source: 已关闭
en: Off

# status.on
source: 已开启
en: On

# status.restricted
source: 受限
en: Restricted

# status.running
source: 运行中
en: Running

# tab.apps
source: App
en: Apps

# tab.logs
source: 日志
en: Logs

# tab.overview
source: 总览
en: Overview

# tab.settings
source: 设置
en: Settings

# time.hours %lld
source: %lld 小时
en: %lld h

# time.hoursAgo %lld
source: %lld 小时前
en: %lld hours ago

# time.hoursMinutesShort %lld %lld
source: %lld小时%lld分钟
en: %lldh %lldm

# time.hoursShort %lld
source: %lld小时
en: %lldh

# time.justNow
source: 刚刚
en: Just now

# time.minutes %lld
source: %lld 分钟
en: %lld min

# time.minutesAgo %lld
source: %lld 分钟前
en: %lld minutes ago

# time.minutesShort %lld
source: %lld分钟
en: %lldm

# time.today %@
source: 今天 %@
en: Today %@

# time.tomorrow %@
source: 明天 %@
en: Tomorrow %@

# unit.minutes
source: 分钟
en: min

source: 东京
en: Tokyo

source: 丢弃
en: Discard

source: 中文
en: Chinese

source: 丹佛
en: Denver

source: 为当前配置方案输入新名称
en: Enter a new name for the current profile

source: 主界面
en: Main Window

source: 优先使用 AppleScript 请求应用保存数据后退出
en: Asks the app to save data via AppleScript before quitting

source: 优雅退出
en: Graceful quit

source: 伦敦
en: London

source: 例如：Safari、微信、Xcode、Terminal
en: For example: Safari, WeChat, Xcode, Terminal

source: 保存
en: Save

source: 保留时间
en: Retention

source: 修改规则
en: Edit rule

source: 关于 AutoToggle
en: About AutoToggle

source: 关闭防系统休眠
en: Turn off system sleep prevention

source: 分类
en: Category

source: 分钟
en: Minute

source: 切换语言后需要重启应用以完全生效。
en: A restart is required for the language change to take full effect.

source: 删除
en: Delete

source: 删除当前配置方案
en: Delete current profile

source: 删除配置方案
en: Delete profile

source: 北京 / 上海
en: Beijing / Shanghai

source: 取消
en: Cancel

source: 台北
en: Taipei

source: 启动
en: Startup

source: 周一
en: Mon

source: 周三
en: Wed

source: 周二
en: Tue

source: 周五
en: Fri

source: 周六
en: Sat

source: 周四
en: Thu

source: 周日
en: Sun

source: 周末
en: Weekend

source: 圣保罗
en: São Paulo

source: 外观
en: Appearance

source: 天
en: days

source: 奥克兰
en: Auckland

source: 定时任务
en: Scheduled Tasks

source: 定时规则将按所选时区触发，默认跟随系统时区。
en: Scheduled rules fire in the selected time zone; the default follows the system.

source: 导入
en: Import

source: 导入配置方案
en: Import profile

source: 导出
en: Export

source: 导出当前配置方案
en: Export current profile

source: 小时
en: Hour

source: 尝试使用不同的关键词，或检查应用是否安装在 /Applications 目录下
en: Try different keywords, or check that the app is installed under /Applications

source: 工作日
en: Weekdays

source: 已关闭
en: Off

source: 已开启
en: On

source: 已授权
en: Authorized

source: 巴黎
en: Paris

source: 应用将被优雅退出（优先使用 AppleScript 保存数据）
en: The app will be quit gracefully (AppleScript is preferred to save data)

source: 应用窗口将被隐藏，应用继续在后台运行
en: The app's windows will be hidden and it keeps running in the background

source: 应用规则
en: App rules

source: 应用闲置
en: App idle

source: 开启防系统休眠
en: Prevent system sleep

source: 开始使用
en: Get started

source: 开罗
en: Cairo

source: 强制退出
en: Force quit

source: 当前编辑的规则尚未保存，是否保存更改？
en: The rule you're editing has unsaved changes. Do you want to save them?

source: 当闲置规则触发时，AutoToggle 将在退出应用前发送系统通知。
en: When an idle rule fires, AutoToggle sends a system notification before quitting the app.

source: 待授权
en: Pending

source: 恢复规则执行
en: Resume rules

source: 打开
en: Open

source: 打开主界面
en: Open main window

source: 打开主界面添加定时或闲置规则
en: Open the main window to add a scheduled or idle rule

source: 打开系统设置
en: Open System Settings

source: 按需授权
en: On demand

source: 提前通知时间
en: Advance notice

source: 搜索规则...
en: Search rules...

source: 文件大小上限
en: Max file size

source: 新加坡
en: Singapore

source: 新建
en: New

source: 新建配置方案
en: New profile

source: 新德里
en: New Delhi

source: 方案名称
en: Profile name

source: 无限制
en: Unlimited

source: 日志上限
en: Entry limit

source: 时区
en: Time zone

source: 暂停所有规则
en: Pause all rules

source: 暂无%@日志
en: No %@ logs

source: 暂无被管理的应用
en: No managed apps

source: 曼谷
en: Bangkok

source: 最低系统要求
en: Minimum requirements

source: 未保存的更改
en: Unsaved Changes

source: 未在使用
en: Not in use

source: 未找到匹配「%@」的规则
en: No rules matching "%@"

source: 未找到匹配的应用
en: No matching apps found

source: 未授权
en: Not authorized

source: 未知应用
en: Unknown app

source: 未运行
en: Not running

source: 权限
en: Permissions

source: 条
en: entries

source: 柏林
en: Berlin

source: 檀香山
en: Honolulu

source: 欢迎使用 AutoToggle
en: Welcome to AutoToggle

source: 每天
en: Every day

source: 永久
en: Forever

source: 注意：正在播放音频、会议中的应用不会被自动关闭
en: Note: apps playing audio or in meetings won't be auto-closed

source: 洛杉矶
en: Los Angeles

source: 活动
en: Activity

source: 活动日志
en: Activity log

source: 活跃
en: Active

source: 浅色模式
en: Light

source: 深色模式
en: Dark

source: 添加定时或闲置规则，让 AutoToggle 自动管理你的应用
en: Add a timed or idle rule to let AutoToggle manage your apps automatically

source: 添加第一条规则
en: Add your first rule

source: 添加规则
en: Add rule

source: 清除
en: Clear

source: 清除当前分类的所有日志
en: Clear all logs in the current category

source: 清除日志
en: Clear logs

source: 点击搜索并选择应用
en: Search and select an app

source: 版本
en: Version

source: 用于实时跟踪键盘焦点，提升应用闲置判断精度。核心闲置检测无需任何权限。
en: Tracks keyboard focus in real time for more accurate idle detection. Core idle detection needs no permission.

source: 用于自动退出和隐藏应用。首次触发时系统会弹出授权提示，按需授予。
en: Used to automatically quit and hide apps. The system prompts for permission on first use; grant it when needed.

source: 界面语言
en: Language

source: 登录时自动启动 AutoToggle
en: Launch AutoToggle at login

source: 目标应用
en: Target app

source: 直接终止应用进程，不会提示保存数据
en: Terminates the app immediately without prompting to save data

source: 确定
en: OK

source: 确定要删除配置方案「%@」吗？其中的所有规则将被永久删除。此操作不可撤销。
en: Delete profile "%@"? All its rules will be permanently deleted. This cannot be undone.

source: 确定要清除所有「%@」日志吗？此操作不可撤销。
en: Clear all "%@" logs? This cannot be undone.

source: 稍后重启
en: Later

source: 立即重启
en: Restart now

source: 系统
en: System

source: 系统日志
en: System log

source: 系统闲置
en: System idle

source: 纽约
en: New York

source: 自动化权限
en: Automation

source: 自定义
en: Custom

source: 芝加哥
en: Chicago

source: 若你已在系统设置中开启授权，重启应用后即可生效。
en: If you've already enabled it in System Settings, restart the app for it to take effect.

source: 莫斯科
en: Moscow

source: 被管理应用
en: Managed Apps

source: 触发日期
en: Trigger days

source: 触发时间
en: Trigger time

source: 触发类型
en: Trigger type

source: 设置 0 表示永久保留/无限制。超过文件大小上限的旧日志将被自动清理。
en: Set 0 to keep forever / no limit. Older logs beyond the size limit are cleaned up automatically.

source: 设置 0 表示永久保留/无限制。超过限制的旧日志将被自动清理。
en: Set 0 to keep forever / no limit. Older logs beyond the limit are cleaned up automatically.

source: 语言
en: Language

source: 语言设置将在重启 AutoToggle 后生效。
en: The language setting takes effect after restarting AutoToggle.

source: 请求授权
en: Request access

source: 跟随系统
en: Follow system

source: 跳过，稍后设置
en: Skip for now

source: 辅助功能权限
en: Accessibility

source: 辅助功能权限用于实时跟踪应用焦点，提升闲置判定精度；未授权不影响核心功能。
en: Accessibility tracks app focus in real time for more accurate idle detection. Core features still work without it.

source: 辅助功能权限（可选）
en: Accessibility (optional)

source: 输入应用名称进行搜索
en: Type an app name to search

source: 运行中
en: Running

source: 还没有任何规则
en: No rules yet

source: 迪拜
en: Dubai

source: 退出
en: Quit

source: 退出 AutoToggle
en: Quit AutoToggle

source: 退出应用
en: Quit app

source: 退出应用前发送通知
en: Send a notification before quitting apps

source: 退出方式
en: Quit method

source: 选择 AutoToggle 配置方案文件
en: Choose an AutoToggle profile file

source: 选择「跟随系统」将自动匹配 macOS 的外观设置。
en: "Follow system" automatically matches the macOS appearance.

source: 选择保存位置
en: Choose where to save

source: 通知
en: Notifications

source: 重命名
en: Rename

source: 重命名当前配置方案
en: Rename current profile

source: 重命名配置方案
en: Rename profile

source: 闲置 %@
en: Idle %@

source: 闲置判定
en: Idle detection

source: 闲置后执行
en: Action after idle

source: 闲置多久后触发
en: Trigger after idle for

source: 防止 Mac 因闲置进入系统休眠或关闭显示器（熄屏但不休眠）。
en: Prevent the Mac from going to sleep or turning off the display when idle (screen off without sleeping).

source: 防止显示器关闭
en: Prevent display sleep

source: 防止系统休眠
en: Prevent system sleep

source: 防睡眠
en: Sleep

source: 隐藏窗口
en: Hide windows

source: 需要重启
en: Restart required

source: 首尔
en: Seoul

source: 香港
en: Hong Kong

source: 导出诊断
en: Export diagnostics
